app/views/interventions/index.html.erb

        <%= f.label :customer_id, "Customer" %><br />
        <%= f.collection_select :customer_id, Customer.order(:id),:id, :company_name, include_blank: true %>
---
SELECT `customers`.* FROM `customers` ORDER BY `customers`.`id` ASC

        <%= f.label :building_id, "Building" %><br />
        <%= f.grouped_collection_select :building_id, Customer.order(:id), :buildings, :id, :full_name_of_the_building_administrator, :id, include_blank: true %>
---
SELECT `buildings`.* FROM `buildings` WHERE `buildings`.`customer_id` = 1
SELECT `customers`.* FROM `customers` ORDER BY `customers`.`id` ASC

        <%= f.label :battery_id, "Battery" %><br />
        <%= f.grouped_collection_select :battery_id, Building.order(:id), :batteries, :id, :id, :id,
        include_blank: true %>
---
SELECT `batteries`.* FROM `batteries` WHERE `batteries`.`building_id` = 1
SELECT `buildings`.* FROM `buildings` ORDER BY `buildings`.`id` ASC

        <%= f.label :column_id, "Column" %><br />
        <%= f.grouped_collection_select :column_id, Battery.order(:id), :columns, :id, :id, :id,
        include_blank: true %>
---
SELECT `batteries`.* FROM `batteries` ORDER BY `batteries`.`id` ASC
SELECT `columns`.* FROM `columns` WHERE `columns`.`battery_id` = 1

        <%= f.label :elevator_id, "Elevator" %><br />
        <%= f.grouped_collection_select :elevator_id, Column.order(:id), :elevators, :id, :id, :id,
        include_blank: true %>
---
SELECT `columns`.* FROM `columns` ORDER BY `columns`.`id` ASC
SELECT `elevators`.* FROM `elevators` WHERE `elevators`.`column_id` = 1

        <%= f.label :employee_id, "Employee" %><br />
        <%= f.collection_select :employee_id, Employee.order(:id), :id, :last_name,
        include_blank: true %>
---
SELECT `employees`.* FROM `employees` ORDER BY `employees`.`id` ASC